Варіант 4
Контекст:
Вам надані дані перепису населення. Кожний рядок – це клас з своїм набором характеристик та позначенням кількості людей, які відносяться до цього класу (fnlwgt). Ваше завдання візуально проаналізувати дані та зробити висновки щодо факторів, які впливають на категорію доходу.
Файл містить фічі:
1.	age: continuous.
2.	workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
3.	fnlwgt: continuous (приблизна оцінка кількості людей, яку представляє кожен рядок даних)
4.	education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
5.	education-num: continuous (кількість років навчання всього)
6.	marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
7.	occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
8.	relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
9.	race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
10.	sex: Female, Male.
11.	capital-gain: continuous.
12.	capital-loss: continuous.
13.	hours-per-week: continuous (скільки годин у тиждень працює)
14.	native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.
15.	Income category ( >50K or <=50K dollars)
Завдання:
1.	Завантажте дані у проект
2.	Зробіть перевірку даних на консистентність та обробіть пропуски, якщо вони є
3.	Зробіть розвідувальний аналіз даних:
a.	Розподіліть дані на вікові підгрупи, виходячи з мінімального та максимального віку у виборці, з шагом у 10 років;
b.	Які перші три вікові підгрупи за найвищим співвідношенням кількісті людей, які заробляють більше 50К доларів на рік, до тих, хто заробляє менше 50К? (про кількість людей)
c.	Що ви можете сказати про кількісний аналіз розподілу освіти / робочого класу по категоріях доходу?

In [1]:
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
def age_group(age: int):
    if age == 18:
        return "18"
    elif 0 < age <= 10:
        return "0-10"
    elif 11 <= age <= 20:
        return "11+"
    elif 21 <= age <= 30:
        return "21+"
    elif 31 <= age <= 40:
        return "31+"
    elif 41 <= age <= 50:
        return "41+"
    elif 51 <= age <= 60:
        return "51+"
    elif 61 <= age <= 70:
        return "61+"
    elif 71 <= age <= 80:
        return "71+"
    elif age >= 81:
        return "81+"
    return None

In [3]:
df = pd.read_csv("adult.csv")
df.columns = ["age", "workclass", "fnlwgt", "education", "education-num", "marital-status", "occupation", "relationship", "race", "sex", "capital-gain","capital-loss", "hours-per-week", "native-country", "Income category"]
df.columns = [column.lower().replace("-", "_").replace(" ", "_") for column in df.columns]
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education_num',
       'marital_status', 'occupation', 'relationship', 'race', 'sex',
       'capital_gain', 'capital_loss', 'hours_per_week', 'native_country',
       'income_category'],
      dtype='object')

In [4]:
df = df[df.age > 0]
df.insert(1, "age_group", [age_group(age) for age in df.age.to_list()])

In [5]:
df[["age", "age_group"]]

       age age_group
0       50       41+
1       38       31+
2       53       51+
3       28       21+
4       37       31+
...    ...       ...
32555   27       21+
32556   40       31+
32557   58       51+
32558   22       21+
32559   52       51+

[32560 rows x 2 columns]

In [6]:
from sklearn.preprocessing import LabelEncoder
df['income_category'] = LabelEncoder().fit_transform(df['income_category'].values)
df["income_category"]

0        0
1        0
2        0
3        0
4        0
        ..
32555    0
32556    1
32557    0
32558    0
32559    1
Name: income_category, Length: 32560, dtype: int32

In [7]:
df_task_b = df[df.income_category == 0].groupby("age_group").age.agg(['count'])

In [8]:
df_task_b.sort_values('count', ascending=False).head(3)

           count
age_group
21+         7482
31+         6139
41+         4328

In [9]:
df_task_c = df[["education", "workclass", "income_category"]].groupby(["income_category", "education"]).count()

In [10]:
df_task_c

                               workclass
income_category education
0                10th                871
                 11th               1115
                 12th                400
                 1st-4th             162
                 5th-6th             317
                 7th-8th             606
                 9th                 487
                 Assoc-acdm          802
                 Assoc-voc          1021
                 Bachelors          3133
                 Doctorate           107
                 HS-grad            8826
                 Masters             764
                 Preschool            51
                 Prof-school         153
                 Some-college       5904
1                10th                 62
                 11th                 60
                 12th                 33
                 1st-4th               6
                 5th-6th              16
                 7th-8th              40
                 9th                  27
                 Assoc-acdm          265
                 Assoc-voc           361
                 Bachelors          2221
                 Doctorate           306
                 HS-grad            1675
                 Masters             959
                 Prof-school         423
                 Some-college       1387